app/Controllers/AuthController.php

SELECT *
FROM `users`
WHERE `username` = 'methiwsuciadi'
 LIMIT 1
---
    public function authenticate()
{
    $username = $this->request->getPost('username');
    $password = $this->request->getPost('password');

    $userModel = new UserModel();
    $user = $userModel->where('username', $username)->first();

INSERT INTO `users` (`username`, `password`, `role`) VALUES ('methiwsuciadi', '$2y$10$KpND8SaYpGylO/JlUVz3LuHIwYvX4gMGFZsolhfmd64fNpb0K.udy', 'user')
---
public function storeUser()
{
    $validation = $this->validate([
        'username' => 'required|is_unique[users.username]|min_length[3]',
        'password' => 'required|min_length[6]',
        'confirm_password' => 'required|matches[password]',
        'role' => 'required|in_list[user,admin]',
    ]);

    if (!$validation) {
        return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
    }

    $userModel = new UserModel();
    $userModel->save([
        'username' => $this->request->getPost('username'),
        'password' => password_hash($this->request->getPost('password'), PASSWORD_BCRYPT),
        'role' => $this->request->getPost('role'),
    ]);