app/Controllers/BooksController.php

    public function index()
    {
        $bookModel = new BookModel();
        $data['books'] = $bookModel->findAll();
---
SELECT *
FROM `books`

public function get($id)
{
    if (session()->get('user')['role'] !== 'admin') {
        return $this->response->setJSON(['error' => 'Unauthorized'])->setStatusCode(403);
    }

    $bookModel = new BookModel();
    $book = $bookModel->find($id);
---
SELECT *
FROM `books`
WHERE `books`.`id` = '8'