app/Controllers/BorrowerController.php

SELECT `borrowers`.*, `books`.`title` as `book_title`
FROM `borrowers`
JOIN `books` ON `books`.`id` = `borrowers`.`id_book`
---
    public function listBorrowers()
    {
        $borrowerModel = new BorrowerModel();
        $data['borrowers'] = $borrowerModel
            ->select('borrowers.*, books.title as book_title')
            ->join('books', 'books.id = borrowers.id_book')
            ->findAll();

SELECT *
FROM `books`
WHERE `status` = 'available'
---
    public function create()
    {
        $bookModel = new BookModel();
        $data['availableBooks'] = $bookModel->where('status', 'available')->findAll();

SELECT *
FROM `books`
WHERE `books`.`id` = '9'
---
    public function store()
    {
        $validation = $this->validate([
            'name' => 'required|min_length[3]',
            'email' => 'required|valid_email',
            'phone_number' => 'required|min_length[10]|max_length[15]',
            'id_book' => 'required|is_not_unique[books.id]',
            'borrow_date' => 'required|valid_date',
            'return_date' => 'required|valid_date'
        ]);

        if (!$validation) {
            return redirect()->back()->withInput()->with('errors', $this->validator->getErrors());
        }

        try {
            $db = \Config\Database::connect();
            $db->transBegin();

            $borrowerModel = new BorrowerModel();
            $bookModel = new BookModel();

            // Verify book availability
            $book = $bookModel->find($this->request->getPost('id_book'));

UPDATE `books` SET `status` = 'borrowed'
WHERE `books`.`id` IN ('9')
---
            ]);

            // Update book status
            $bookModel->update($this->request->getPost('id_book'), [
                'status' => 'borrowed'
            ]);