app/Controllers/DashboardAnalyticsController.php

    public function getStatistics()
    {
        $bookModel = new BookModel();
        $borrowerModel = new BorrowerModel();

        // Total Books
        $totalBooks = $bookModel->countAll();

        // Total Books Added This Month
        $booksThisMonth = $bookModel->where('MONTH(created_at)', date('m'))
                                   ->where('YEAR(created_at)', date('Y'))
                                   ->countAllResults();

        // Active Users (users with active borrowings)
        $activeUsers = $borrowerModel->select('name')
                                   ->distinct()
                                   ->where('return_date >=', date('Y-m-d'))
                                   ->countAllResults();

        // User Increase vs Last Week
        $lastWeekUsers = $borrowerModel->select('name')
                                     ->distinct()
                                     ->where('created_at >=', date('Y-m-d', strtotime('-7 days')))
                                     ->countAllResults();

        // Currently Borrowed Books
        $borrowedBooks = $bookModel->where('status', 'borrowed')->countAllResults();
---
SELECT COUNT(*) AS `numrows` FROM `books`
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE MONTH(created_at) = '02'
AND YEAR(created_at) = '2025'
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `name`
FROM `borrowers`
WHERE `return_date` >= '2025-02-02'
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM (
SELECT DISTINCT `name`
FROM `borrowers`
WHERE `created_at` >= '2025-01-26'
) CI_count_all_results
SELECT COUNT(*) AS `numrows`
FROM `books`
WHERE `status` = 'borrowed'